Ran Plan for 2 projects:

1. dir: `cloudamqp/instance` workspace: `default`
1. dir: `cloudamqp/vpc` workspace: `default`

### 1. dir: `cloudamqp/instance` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/tampubolon/pintu-infra/1/default/cloudamqp/instance/default.tfplan\"" in "/root/.atlantis/repos/tampubolon/pintu-infra/1/default/cloudamqp/instance": exit status 1
data.aws_ssm_parameter.api_key: Reading...

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: describing SSM parameter (/iss/staging/cloudamqp/cloudamqp-key): ParameterNotFound: 
│ 
│   with data.aws_ssm_parameter.api_key,
│   on main.tf line 19, in data "aws_ssm_parameter" "api_key":
│   19: data "aws_ssm_parameter" "api_key" {
│ 
╵


```
</details>

---
### 2. dir: `cloudamqp/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.api_key: Reading...
data.aws_ssm_parameter.api_key: Read complete after 0s [id=/pintu/cloudamqp-api-key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudamqp_vpc_info.vpc_info will be read during apply
  # (config refers to values not yet known)
 <= data "cloudamqp_vpc_info" "vpc_info" {
      + id                = (known after apply)
      + name              = (known after apply)
      + owner_id          = (known after apply)
      + security_group_id = (known after apply)
      + vpc_id            = (known after apply)
      + vpc_subnet        = (known after apply)
    }

  # cloudamqp_vpc.vpc will be created
+ resource "cloudamqp_vpc" "vpc" {
      + id       = (known after apply)
      + name     = "pintu"
      + region   = "amazon-web-services::ap-southeast-1"
      + subnet   = "10.124.0.0/24"
      + tags     = [
          + "Terraform",
        ]
      + vpc_name = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ vpc_info = {
      + id                = (known after apply)
      + instance_id       = null
      + name              = (known after apply)
      + owner_id          = (known after apply)
      + security_group_id = (known after apply)
      + vpc_id            = (known after apply)
      + vpc_subnet        = (known after apply)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d cloudamqp/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://1688-13-212-101-106.ngrok-free.app/lock?id=tampubolon%252Fpintu-infra%252Fcloudamqp%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d cloudamqp/vpc`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`